[
  {
    "id": "balakrishnan",
    "name": "Bala Krishnan",
    "picture": "https://wfkq0nguanh0273r.public.blob.vercel-storage.com/mentorbridge-pics/balakrishnan.jpg",
    "role": "Mobile App Developer",
    "email": "sbkrish2506@gmail.com",
    "summary": "I am a passionate and results-driven React Native Developer with a strong foundation in JavaScript, React.js, and TypeScript. As the co-founder of StuPro, I specialize in designing and developing high-performing, user-friendly mobile applications. With a keen interest in Data Science and AI, I constantly explore ways to integrate analytics into app development to enhance user experiences. My UI/UX expertise in Figma allows me to create intuitive, visually appealing applications that prioritize user engagement. Beyond development, I excel in problem-solving, critical thinking, and collaboration, ensuring efficient teamwork in agile environments.",
    "experience": [
      {
        "company": "Break Time Tv",
        "role": "Mobile App Developer",
        "summary": "Break Time Tv - Live TV Streaming App is a feature-rich React Native application designed to provide a seamless streaming experience. The app allows users to browse and watch world free live TV channels, switch between different languages, and access high-quality video content.",
        "website": "https://github.com/SBKrishnan/BreakTimeTv"
      }
    ],
    "mentorBridgeExp": {
      "company": "StuPro",
      "role": "Co-Founder | Mobile App Developer",
      "summary": "I gained extensive hands-on experience in JavaScript, React.js, and React Native, contributing significantly to the development of a TypeScript-based React Native application named Stupro. I was responsible for creating multiple pages and modules, including onboarding, Daily Challenges, Profile, and Leaderboard pages, while implementing key features such as carousels, async storage, animations, and navigation. For the onboarding page, I utilized FlatList with default animations and pagination to enhance user experience. On the Daily Challenges page, I mapped tasks dynamically to create an engaging interface. The Profile page was designed with a card-style layout to display user information, streak details, and access to change password and preferences pages. The Leaderboard page showcased a list of top performers based on points earned through daily challenges. I leveraged the react-native-reanimated-carousel package to implement a carousel on the home page and used Async Storage for offline storage of profile details and user credentials. Navigation across the application was seamlessly handled using React Native Navigation, while animations were enhanced with the React Native Reanimated package to improve user experience. Additionally, I collaborated closely with the team to develop and refine application features, actively participating in team discussions, problem-solving sessions, and code reviews in an agile environment. My role also involved using Figma to design sitemaps and structure multiple pages, ensuring a seamless and intuitive user experience. This experience allowed me to grow as a developer, fostering collaboration, continuous learning, and a strong focus on delivering high-quality solutions.",
      "website": "http://stupro.info"
    },
    "skillSets": [
      "JavaScript",
      "React",
      "React Native",
      "TypeScript",
      "HTML",
      "CSS",
      "Firebase",
      "Java",
      "SpringBoot",
      "RESTful API",
      "Node.js",
      "MongoDB",
      "Figma",
      "AWS",
      "Docker",
      "CI/CD",
      "Git",
      "GitHub",
      "Python",
      "Data Preprocessing",
      "Matplotlib",
      "Seaborn",
      "Scikit-learn",
      "Machine learning",
      "Deep learning",
      "Excel",
      "SQL",
      "PowerBI",
      "Adaptablity",
      "Creativity",
      "Collaboration",
      "Critical Thinking",
      "Problem Solving"
    ],
    "inspirations": ["APJ Abdul Kalam", "Warren Buffett"],
    "socialLinks": {
      "linkedIn": "https://linkedin.com/in/bala-krishnan-bk",
      "gitHub": "https://github.com/SBKrishnan",
      "website": ""
    },
    "batch": "2025",
    "company": "Techjays",
    "resumeLink": "https://wfkq0nguanh0273r.public.blob.vercel-storage.com/mentorbridge-pics/balakrishnan.pdf"
  },
  {
    "id": "bavani",
    "name": "Bavani K",
    "picture": "https://wfkq0nguanh0273r.public.blob.vercel-storage.com/mentorbridge-pics/bavani.jpg",
    "role": "Mobile App Developer",
    "email": "bavanikannan2412@gmail.com",
    "summary": "Passionate mobile app developer with skills in React Native, Flutter, React.js, and UI/UX design. Experienced in building responsive apps and crafting seamless user experiences using Figma",
    "experience": [
      {
        "company": "Accent Techno Soft",
        "role": "Mobile App Developer",
        "summary": "Designed product interfaces and user flows, contributing to the overall user experience of the platform. Created Built a mobile app to help users track daily calorie intake and monitor health goals.",
        "website": "http://stupro.info"
      },
      {
        "company": "Savel Software",
        "role": "Mobile App Developer",
        "summary": "Designed product interfaces and user flows, contributing to the overall user experience of the platform. Create a Flutter mobile app to find and connect with local area workers. Features user-friendly UI, location-based search, and worker profile Browse.",
        "website": "http://stupro.info"
      }
    ],
    "mentorBridgeExp": {
      "company": "StuPro",
      "role": "Co-Founder | Mobile App Developer|Frontend Dev Engineer",
      "summary": "Designed product interfaces and user flows, contributing to the overall user experience of the platform. Created A productivity app for students developed with React Native. Built key mobile app features using React Native and TypeScript, including dynamic UI components with real-time data integration.",
      "website": "http://stupro.info"
    },
    "skillSets": [
      "ReactNative",
      "TypeScript",
      "Node.js",
      "Flutter",
      "Html",
      "Css",
      "JavaScript"
    ],
    "inspirations": ["Virat Kohli"],
    "socialLinks": {
      "linkedIn": "https://www.linkedin.com/in/bavani-kannan-b15938287/",
      "gitHub": "https://github.com/bavanikannan12"
    },
    "batch": "2025",
    "company": "Techjays",
    "resumeLink": "https://wfkq0nguanh0273r.public.blob.vercel-storage.com/mentorbridge-pics/bavani.pdf"
  },
  {
    "id": "devaki_ravi",
    "name": "Devaki Ravi",
    "picture": "https://wfkq0nguanh0273r.public.blob.vercel-storage.com/mentorbridge-pics/devaki_ravi.jpeg",
    "role": "Backend Dev Engineer",
    "email": "devakiravi226@gmail.com",
    "summary": "Driven and detail-oriented Backend Developer with hands-on experience in designing and developing robust, scalable APIs using Java and the Spring Boot framework. My expertise lies in creating efficient backend systems that ensure performance, maintainability, and seamless integration with frontend services.",
    "experience": [
      {
        "company": "Seval Software Solutions",
        "role": "intern",
        "summary": "I gained practical experience in full-stack development. I worked on building responsive web pages using HTML, CSS, and JavaScript, with an emphasis on usability, structure, and performance—giving me a solid foundation in how backend services connect with frontend interfaces.",
        "website": ""
      }
    ],
    "mentorBridgeExp": {
      "company": "Stublab",
      "role": "Co-Founder | Backend Dev Engineer",
      "summary": "I worked as a backend lead, where I was responsible for developing RESTful APIs following best coding practices. My role focused on building scalable and maintainable backend architectures, improving system performance, and contributing to real-world product development in a startup environment.",
      "website": "https://www.stublab.in/"
    },
    "skillSets": [
      "Java",
      "Springboot",
      "Python",
      "Html",
      "css",
      "MongoDB",
      "Git",
      "Github",
      "Figma"
    ],
    "inspirations": ["APJ Abdul Kalam", "Srinivasa Ramanujan"],
    "socialLinks": {
      "linkedIn": "https://www.linkedin.com/in/devaki-r-701b882b4/",
      "gitHub": "https://github.com/devakiravi",
      "website": ""
    },
    "batch": "2025",
    "company": "Klyonix",
    "resumeLink": "https://wfkq0nguanh0273r.public.blob.vercel-storage.com/mentorbridge-pics/devaki_ravi.pdf"
  },
  {
    "id": "harini",
    "name": "HARINI S",
    "picture": "https://wfkq0nguanh0273r.public.blob.vercel-storage.com/mentorbridge-pics/harini.jpg",
    "role": "Backend Dev Engineer",
    "email": "harinisundar81002@gmail.com",
    "summary": "Innovative UI/UX Designer, Graphic Designer, and Backend Developer with a strong foundation in crafting intuitive digital experiences and scalable backend solutions. Proficient in Figma, Adobe Creative Suite (Photoshop, Illustrator, Jitter), Elementor, HTML, CSS, JavaScript, React.js, Spring Boot, and MySQL, I specialize in designing user-centric interfaces, developing robust APIs, and creating visually compelling graphics. With hands-on experience in a UI/UX internship at Sarva Vidhya, I have designed engaging websites, mobile apps, wireframes, and brand identities. My graphic design expertise includes logos, posters, product labels, and marketing materials, with notable work such as the Zuha Perfumes logo and label, product design for Nigal Mazhil, and product design for Mentor Bridge. As a Backend Developer, I focus on building efficient APIs with Spring Boot, contributing to projects like StubLab, an AI-integrated stub server streamlining API development and testing. Additionally, my experience working at Mentor Bridge, a startup, has enhanced my backend development skills, allowing me to gain deeper insights into API architecture and system scalability while also contributing to product design. Passionate about design, technology, and innovation, I thrive in dynamic environments, leveraging my cross-disciplinary expertise to deliver impactful digital solutions that balance functionality, aesthetics, and performance.",
    "experience": [
      {
        "company": "Sarva Vidhya Solutions",
        "role": "UI/UX and Graphic Designer",
        "summary": "Gained hands-on experience in UI/UX design, focusing on user-centered design principles. Created mockups, wireframes, and prototypes to enhance user experience and interface design. Designed logos, product designs, and labels for various projects, ensuring brand consistency. Worked with Adobe Creative Suite (Photoshop, Illustrator), Elementor, Jitter, Figma, and Canva to develop high-quality visual assets. Designed engaging marketing materials, posters, and branding elements for digital and print media. Contributed to the development of interactive and responsive UI components for web platforms.",
        "website": ""
      }
    ],
    "mentorBridgeExp": {
      "company": "StubLab",
      "role": "Co-Founder | Backend Dev Engineer",
      "summary": "Developed and documented REST APIs using Spring Boot to ensure seamless integration and functionality. Created API documentation to facilitate easy understanding and implementation. Conducted API testing using Postman to validate endpoints, responses, and performance. Collaborated with the team to improve design consistency and enhance the platform’s usability.",
      "website": "http://stublab.in"
    },
    "skillSets": [
      "React",
      "Spring Boot",
      "UI/UX",
      "AWS",
      "Docker",
      "CI/CD",
      "GitHub",
      "MongoDB"
    ],
    "inspirations": ["Sunitha Williams"],
    "socialLinks": {
      "linkedIn": "https://www.linkedin.com/in/harini-sundaralingam-13348835a",
      "gitHub": "https://github.com/Harinisundar08",
      "website": ""
    },
    "batch": "2025",
    "company": "Techjays",
    "resumeLink": "https://wfkq0nguanh0273r.public.blob.vercel-storage.com/mentorbridge-pics/harini.pdf"
  },
  {
    "id": "jeyaraman",
    "name": "Jeyaraman S",
    "picture": "https://wfkq0nguanh0273r.public.blob.vercel-storage.com/mentorbridge-pics/jeyaraman.jpg",
    "role": "Frontend Dev Engineer",
    "email": "jeyaraman.saravanan23@gmail.com",
    "summary": "Web developer with strong skills in JavaScript, TypeScript, and React.js. Proficient in building responsive web applications and integrating APIs efficiently. Passionate about creating seamless user experiences and optimizing frontend performance.",
    "experience": [
      {
        "company": "Vinculo | e-Commerce Platform",
        "role": "Full-Stack Developer Intern",
        "summary": "Developed a complete e-commerce platform using React, Node.js, Express.js, and MongoDB. Designed and implemented key features such as user authentication, product search and Browse, shopping cart, checkout, and payment system integration. Focused on enhancing UI/UX by creating a responsive and user-friendly interface. Specifically contributed to UI design, search functionality, and payment system integration.",
        "website": "https://vinculoshop.com"
      },
      {
        "company": "Tech Vaseegrah - Billzzy Landing Page",
        "role": "Frontend Developer Intern",
        "summary": "Designed and developed a modern, responsive landing page using React, TypeScript, and Tailwind CSS. Implemented lazy loading, animations using Framer Motion, and reusable components for scalability. Focused on performance optimization to enhance user experience.",
        "website": "https://tech-vaseegrah.vercel.app/"
      }
    ],
    "mentorBridgeExp": {
      "company": "SecuroSphere",
      "role": "Frontend Dev Engineer",
      "summary": "Led frontend development and UI/UX design for SecuroSphere. Developed interfaces in Figma and implemented them using React.js and TypeScript. Integrated APIs with TanStack Query and managed deployments on Vercel. Used Hotjar, PostHog, Google Analytics, and Sentry for tracking user behavior and performance. Handled product pitching and social media promotion.",
      "website": "https://www.securosphere.in/"
    },
    "skillSets": [
      "Java",
      "JavaScript",
      "TypeScript",
      "React.js",
      "Tailwind CSS",
      "Figma",
      "GitHub"
    ],
    "inspirations": ["Mark Zuckerberg", "Vetrimaaran"],
    "socialLinks": {
      "linkedIn": "https://www.linkedin.com/in/jeyaraman23/",
      "gitHub": "https://github.com/Jagan6923",
      "website": "https://jeyaraman.me/"
    },
    "batch": "2025",
    "company": "Frigate",
    "resumeLink": "https://wfkq0nguanh0273r.public.blob.vercel-storage.com/mentorbridge-pics/jeyaraman.pdf"
  },
  {
    "id": "Jeyashree",
    "name": "Jeyashree S",
    "picture": "https://wfkq0nguanh0273r.public.blob.vercel-storage.com/mentorbridge-pics/Jeyashree.jpg",
    "role": "Frontend Dev Engineer",
    "email": "jeyashreeselvan9@gmail.com",
    "summary": "I am currently pursuing final year of B.E. in Computer Science and Engineering at SSMIET. I am a passionate front-end developer with experience in building responsive and user-friendly web applications. I am the Co-founder and Front-End Developer of Securosphere. My core areas of interest lie in Front-End Development and UI/UX Design. I am proficient in technologies such as HTML, CSS, JavaScript, React.js, Bootstrap, and TypeScript. Additionally, I have strong skills in UI design, with hands-on experience using design tools like Figma and Canva.",
    "experience": [
      {
        "company": "Virtualtechnology",
        "role": "Frontend Developer",
        "summary": "Using front-end development, I completed a Pet shop website and built a responsive web design. Only using HTML, CSS, Bootstrap, and media queries to make responsive pages.",
        "website": null
      },
      {
        "company": "Seval Software Solution",
        "role": "Front-end Engineer",
        "summary": "I have completed a web development internship during which I worked on a banking system project using HTML, CSS, and JavaScript. Created interactive and visually appealing interfaces.",
        "website": null
      }
    ],
    "mentorBridgeExp": {
      "company": "Securosphere",
      "role": "Co-Founder | Front-End Engineer",
      "summary": "I have contributed to key modules such as the Registration Page, Multi-Factor Authentication (MFA), reCAPTCHA, GitHub integration, cookie management, and RESTful API integration. I have actively participated in pitching and promoting our product at various platforms and events.",
      "website": "http://securosphere.in"
    },
    "skillSets": [
      "HTML",
      "CSS",
      "Bootstrap",
      "React.js",
      "TypeScript",
      "UI/UX"
    ],
    "inspirations": ["Ratan Tata", "Dr. A.P.J. Abdul Kalam"],
    "socialLinks": {
      "linkedIn": "https://www.linkedin.com/in/jeya-shree-s/",
      "gitHub": "https://github.com/JEYASHREESELVAN",
      "website": null
    },
    "batch": "2025",
    "company": "Klyonix",
    "resumeLink": "https://wfkq0nguanh0273r.public.blob.vercel-storage.com/mentorbridge-pics/Jeyashree.pdf"
  },
  {
    "id": "kajalakshmi",
    "name": "Kajalakshmi M",
    "picture": "https://wfkq0nguanh0273r.public.blob.vercel-storage.com/mentorbridge-pics/kajalakshmi.jpeg",
    "role": "Frontend Dev Engineer",
    "email": "mkajalakshmi@gmail.com",
    "summary": "I'm a passionate Frontend Developer and Co-founder of SecuroSphere, currently pursuing my Bachelor's degree in Computer Science Engineering at SSMIET. Specialized in building scalable, responsive user interfaces using React.js and Bootstrap, focusing on performance and accessibility. Beyond development and design, I also created and presented the pitch deck for SecuroSphere, helping effectively communicate our product vision to internal teams, college management, and potential collaborators.",
    "experience": [
      {
        "company": "Seval Software Solutions",
        "role": "Frontend Developer",
        "summary": "TastyTrails website frontend was built with a focus on clean design, responsiveness, and intuitive user experience using React.js and Bootstrap. Developed interactive UI components and implemented smooth navigation flows to enhance user engagement across the platform.",
        "website": null
      }
    ],
    "mentorBridgeExp": {
      "company": "SecuroSphere",
      "role": "Co-founder | Frontend Developer",
      "summary": "Contributed to the complete UI development using React.js, TypeScript, and Bootstrap. Designed UI/UX layouts and branding assets using Figma and Canva. Worked on core product pages including login, email verification, OTP entry, and email template setup. Collaborated with the team through GitHub, Jira, Teams, and Confluence. Helped design and present the pitch deck to effectively communicate the product vision to stakeholders.",
      "website": "https://securosphere.in"
    },
    "skillSets": [
      "HTML",
      "CSS",
      "Bootstrap",
      "React",
      "JavaScript",
      "Figma",
      "Python",
      "Java"
    ],
    "inspirations": ["Mahakavi Bharathi", "APJ Abdul Kalam"],
    "socialLinks": {
      "linkedIn": "https://www.linkedin.com/in/kajalakshmi-m",
      "gitHub": "https://github.com/Kajalakshmi11",
      "website": null
    },
    "batch": "2025",
    "company": "Klyonix",
    "resumeLink": "https://wfkq0nguanh0273r.public.blob.vercel-storage.com/mentorbridge-pics/kajalakshmi.pdf"
  },
  {
    "id": "jeyaraman",
    "name": "Jeyaraman S",
    "picture": "https://wfkq0nguanh0273r.public.blob.vercel-storage.com/mentorbridge-pics/jeyaraman.jpg",
    "role": "Frontend Dev Engineer",
    "email": "jeyaraman.saravanan23@gmail.com",
    "summary": "Web developer with strong skills in JavaScript, TypeScript, and React.js. Proficient in building responsive web applications and integrating APIs efficiently. Passionate about creating seamless user experiences and optimizing frontend performance.",
    "experience": [
      {
        "company": "Vinculo | e-Commerce Platform",
        "role": "Full-Stack Developer Intern",
        "summary": "Developed a complete e-commerce platform using React, Node.js, Express.js, and MongoDB. Designed and implemented key features such as user authentication, product search and Browse, shopping cart, checkout, and payment system integration. Focused on enhancing UI/UX by creating a responsive and user-friendly interface. Specifically contributed to UI design, search functionality, and payment system integration.",
        "website": "https://vinculoshop.com"
      },
      {
        "company": "Tech Vaseegrah - Billzzy Landing Page",
        "role": "Frontend Developer Intern",
        "summary": "Designed and developed a modern, responsive landing page using React, TypeScript, and Tailwind CSS. Implemented lazy loading, animations using Framer Motion, and reusable components for scalability. Focused on performance optimization to enhance user experience.",
        "website": "https://tech-vaseegrah.vercel.app/"
      }
    ],
    "mentorBridgeExp": {
      "company": "SecuroSphere",
      "role": "Frontend Dev Engineer",
      "summary": "Led frontend development and UI/UX design for SecuroSphere. Developed interfaces in Figma and implemented them using React.js and TypeScript. Integrated APIs with TanStack Query and managed deployments on Vercel. Used Hotjar, PostHog, Google Analytics, and Sentry for tracking user behavior and performance. Handled product pitching and social media promotion.",
      "website": "https://www.securosphere.in/"
    },
    "skillSets": [
      "Java",
      "JavaScript",
      "TypeScript",
      "React.js",
      "Tailwind CSS",
      "Figma",
      "GitHub"
    ],
    "inspirations": ["Mark Zuckerberg", "Vetrimaaran"],
    "socialLinks": {
      "linkedIn": "https://www.linkedin.com/in/jeyaraman23/",
      "gitHub": "https://github.com/Jagan6923",
      "website": "https://jeyaraman.me/"
    },
    "batch": "2025",
    "company": "Frigate",
    "resumeLink": "https://wfkq0nguanh0273r.public.blob.vercel-storage.com/mentorbridge-pics/jeyaraman.pdf"
  },
  {
    "id": "Jeyashree",
    "name": "Jeyashree S",
    "picture": "https://wfkq0nguanh0273r.public.blob.vercel-storage.com/mentorbridge-pics/Jeyashree.jpg",
    "role": "Frontend Dev Engineer",
    "email": "jeyashreeselvan9@gmail.com",
    "summary": "I am currently pursuing final year of B.E. in Computer Science and Engineering at SSMIET. I am a passionate front-end developer with experience in building responsive and user-friendly web applications. I am the Co-founder and Front-End Developer of Securosphere. My core areas of interest lie in Front-End Development and UI/UX Design. I am proficient in technologies such as HTML, CSS, JavaScript, React.js, Bootstrap, and TypeScript. Additionally, I have strong skills in UI design, with hands-on experience using design tools like Figma and Canva.",
    "experience": [
      {
        "company": "Virtualtechnology",
        "role": "Frontend Developer",
        "summary": "Using front-end development, I completed a Pet shop website and built a responsive web design. Only using HTML, CSS, Bootstrap, and media queries to make responsive pages.",
        "website": null
      },
      {
        "company": "Seval Software Solution",
        "role": "Front-end Engineer",
        "summary": "I have completed a web development internship during which I worked on a banking system project using HTML, CSS, and JavaScript. Created interactive and visually appealing interfaces.",
        "website": null
      }
    ],
    "mentorBridgeExp": {
      "company": "Securosphere",
      "role": "Co-Founder | Front-End Engineer",
      "summary": "I have contributed to key modules such as the Registration Page, Multi-Factor Authentication (MFA), reCAPTCHA, GitHub integration, cookie management, and RESTful API integration. I have actively participated in pitching and promoting our product at various platforms and events.",
      "website": "http://securosphere.in"
    },
    "skillSets": [
      "HTML",
      "CSS",
      "Bootstrap",
      "React.js",
      "TypeScript",
      "UI/UX"
    ],
    "inspirations": ["Ratan Tata", "Dr. A.P.J. Abdul Kalam"],
    "socialLinks": {
      "linkedIn": "https://www.linkedin.com/in/jeya-shree-s/",
      "gitHub": "https://github.com/JEYASHREESELVAN",
      "website": null
    },
    "batch": "2025",
    "company": "Klyonix",
    "resumeLink": "https://wfkq0nguanh0273r.public.blob.vercel-storage.com/mentorbridge-pics/Jeyashree.pdf"
  },
  {
    "id": "kajalakshmi",
    "name": "Kajalakshmi M",
    "picture": "https://wfkq0nguanh0273r.public.blob.vercel-storage.com/mentorbridge-pics/kajalakshmi.jpeg",
    "role": "Frontend Dev Engineer",
    "email": "mkajalakshmi@gmail.com",
    "summary": "I'm a passionate Frontend Developer and Co-founder of SecuroSphere, currently pursuing my Bachelor's degree in Computer Science Engineering at SSMIET. Specialized in building scalable, responsive user interfaces using React.js and Bootstrap, focusing on performance and accessibility. Beyond development and design, I also created and presented the pitch deck for SecuroSphere, helping effectively communicate our product vision to internal teams, college management, and potential collaborators.",
    "experience": [
      {
        "company": "Seval Software Solutions",
        "role": "Frontend Developer",
        "summary": "TastyTrails website frontend was built with a focus on clean design, responsiveness, and intuitive user experience using React.js and Bootstrap. Developed interactive UI components and implemented smooth navigation flows to enhance user engagement across the platform.",
        "website": null
      }
    ],
    "mentorBridgeExp": {
      "company": "SecuroSphere",
      "role": "Co-founder | Frontend Developer",
      "summary": "Contributed to the complete UI development using React.js, TypeScript, and Bootstrap. Designed UI/UX layouts and branding assets using Figma and Canva. Worked on core product pages including login, email verification, OTP entry, and email template setup. Collaborated with the team through GitHub, Jira, Teams, and Confluence. Helped design and present the pitch deck to effectively communicate the product vision to stakeholders.",
      "website": "https://securosphere.in"
    },
    "skillSets": [
      "HTML",
      "CSS",
      "Bootstrap",
      "React",
      "JavaScript",
      "Figma",
      "Python",
      "Java"
    ],
    "inspirations": ["Mahakavi Bharathi", "APJ Abdul Kalam"],
    "socialLinks": {
      "linkedIn": "https://www.linkedin.com/in/kajalakshmi-m",
      "gitHub": "https://github.com/Kajalakshmi11",
      "website": null
    },
    "batch": "2025",
    "company": "Klyonix",
    "resumeLink": "https://wfkq0nguanh0273r.public.blob.vercel-storage.com/mentorbridge-pics/kajalakshmi.pdf"
  },
  {
    "id": "Karthekeyan_M",
    "name": "Karthekeyan M",
    "picture": "https://wfkq0nguanh0273r.public.blob.vercel-storage.com/mentorbridge-pics/Karthekeyan_M.jpg",
    "role": "Frontend Dev Engineer",
    "email": "karthekeyan.muruganantham@gmail.com",
    "summary": "I am a passionate Full Stack Developer with experience in building web applications using MERN stack. I have worked on different projects like e-commerce websites and API tools, and I enjoy creating user-friendly and responsive web apps.",
    "experience": [
      {
        "company": "Vinculo",
        "role": "Full Stack Developer",
        "summary": "Developed responsive and user-friendly UI using React js.Integrated Razorpay payment gateway to enable secure and seamless transactions. Built APIs with Node.js and Express.js for fetching product and user data from MongoDB.",
        "website": "https://www.vinculoshop.com"
      }
    ],
    "mentorBridgeExp": {
      "company": "Stublab",
      "role": "Co-Founder | Frontend Dev Engineer",
      "summary": "Enhanced the landing page to improve user experience and visual appeal.Developed the frontend using React.js with a focus on responsiveness and usability. Integrated APIs to enable dynamic data interaction between the frontend and backend. Designed the project logo to align with the application's theme and branding.",
      "website": "http://www.stublab.in"
    },
    "skillSets": [
      "Java",
      "HTML",
      "CSS",
      "Javascript",
      "React JS",
      "node JS",
      "MongoDB",
      "Figma",
      "Git",
      "GitHub",
      "Canva"
    ],
    "inspirations": ["MS Dhoni", "Nicholas Pooran"],
    "socialLinks": {
      "linkedIn": "https://www.linkedin.com/in/karthekeyan-m/",
      "gitHub": "https://github.com/karthi049",
      "website": ""
    },
    "batch": "2025",
    "company": "MentorBridge",
    "resumeLink": "https://wfkq0nguanh0273r.public.blob.vercel-storage.com/mentorbridge-pics/Karthekeyan_M.pdf"
  },
  {
    "id": "Kiruthika_G",
    "name": "Kiruthika G",
    "picture": "https://wfkq0nguanh0273r.public.blob.vercel-storage.com/mentorbridge-pics/Kiruthika_G.jpeg",
    "role": "Frontend Dev Engineer",
    "email": "kiruthikaganesan757@gmail.com",
    "summary": "Creative and focused Frontend Developer with hands-on experience in building mobile applications using React Native. As the co-founder of StuPro, I’ve designed smooth, user-friendly interfaces and implemented key features like push notifications and loading indicators with Context API. Proficient in Java and modern frontend practices, with a good understanding of Agile development and tools like Jira. Dedicated to crafting clean, responsive designs that enhance user engagement and functionality.",
    "experience": [
      {
        "company": "System Tron",
        "role": "Web developer",
        "summary": "Developed Netflix Clone which enhanced my knowledge in HTML,CSS,Javascript.",
        "website": null
      }
    ],
    "mentorBridgeExp": {
      "company": "StuPro",
      "role": "Co-Founder | Frontend Dev Engineer",
      "summary": "Developed user-friendly mobile app screens using React Native. Push Notification System – Worked on FCM to send Sentence of the Day updates. Activity Indicator Component – Designed a loading spinner and GIF-based loaders for better UI responsiveness. Dynamic & Interactive User Interfaces – Developed smooth and engaging UI components in React Native.",
      "website": "http://stupro.info"
    },
    "skillSets": [
      "React",
      "TypeScript",
      "Java",
      "React Native",
      "HTML",
      "CSS",
      "JavaScript",
      "UI/UX"
    ],
    "inspirations": ["APJ Abdul Kalam"],
    "socialLinks": {
      "linkedIn": "https://www.linkedin.com/in/kiruthii/",
      "gitHub": "https://github.com/kiruthii",
      "website": ""
    },
    "batch": "2025",
    "company": "Techjays",
    "resumeLink": "https://wfkq0nguanh0273r.public.blob.vercel-storage.com/mentorbridge-pics/Kiruthika_G.pdf"
  },
  {
    "id": "meena",
    "name": "Meena S",
    "picture": "https://wfkq0nguanh0273r.public.blob.vercel-storage.com/mentorbridge-pics/meena.jpg",
    "role": "Mobile App Developer",
    "email": "meenasivakumar44@gmail.com",
    "summary": "Passionate and detail-oriented Mobile App Developer with expertise in Flutter, React Native, and Java. Experienced in building scalable applications, integrating APIs, and working with Firebase for real-time data management.",
    "experience": [
      {
        "company": "Accent Techno Soft",
        "role": "Mobile App Developer",
        "summary": "Gained hands-on experience with the Flutter framework and Sqflite database. Developed a Tour Guide App that showcases popular destinations, enabling users to share visited locations, upload images, and add descriptive insights.",
        "website": ""
      },
      {
        "company": "NSCI",
        "role": "Mobile App Developer",
        "summary": "Technologies: Java, WeatherAPI, GPS, Volley, Picasso, RecyclerView. Developed an Android weather app that provides real-time forecasts using WeatherAPI. Integrated GPS-based updates for location-based weather, used Volley for fast network requests, Picasso for image loading, and RecyclerView for smooth data display. Features: Live Weather Updates -Temperature, Humidity, Wind Speed. GPS-based Location Tracking for Accurate Forecasts.Optimized API Calls with Volley for Efficient Data Retrieval. Smooth UI with RecyclerView & Picasso.",
        "website": "https://github.com/MeenaSivakumar/WeatherApp"
      }
    ],
    "mentorBridgeExp": {
      "company": "StuPro",
      "role": "Co-Founder | Technical Analyst",
      "summary": "Designed and developed the Feedback Page, enabling users to submit feedback seamlessly. Created the Change Password Page with secure validation and API integration.Resolved UI/UX issues and optimized the interface for a better user experience. Developed a secure API for user authentication via OTP validation. Created an endpoint to store user feedback in the database.Automated the retrieval of AI-generated daily challenges, coding tasks, quizzes, and tech facts.Implemented a cron scheduler to fetch and store this data periodically in MongoDB.",
      "website": "http://stupro.info"
    },
    "skillSets": [
      "Java",
      "TypeScript",
      "React",
      "Javascript",
      "Flutter",
      "SpringBoot",
      "Figma",
      "Git",
      "GitHub"
    ],
    "inspirations": ["Virat Kohli", "Kunal Kushwaha"],
    "socialLinks": {
      "linkedIn": "https://www.linkedin.com/in/meena-34-b59912268/",
      "gitHub": "https://github.com/MeenaSivakumar",
      "website": ""
    },
    "batch": "2025",
    "company": "Techjays",
    "resumeLink": "https://wfkq0nguanh0273r.public.blob.vercel-storage.com/mentorbridge-pics/meena.pdf"
  },
  {
    "id": "Nithya_Bala_M",
    "name": "Nithya Bala M",
    "picture": "https://wfkq0nguanh0273r.public.blob.vercel-storage.com/mentorbridge-pics/Nithya_Bala_M.jpg",
    "role": "Frontend Dev Engineer",
    "email": "nithyabala02062004@gmail.com",
    "summary": "Frontend Developer with a good understanding of HTML, CSS, and React.js. Skilled in building responsive web designs and creating clean, user-friendly interfaces. Experienced in using Figma for wireframing and prototyping. Interested in web development and working in a team environment. Also familiar with Excel and SQL, helpful for basic data handling and integration.",
    "experience": [
      {
        "company": "Seval software solutions.",
        "role": "Frontend dev engineer",
        "summary": "Acquired practical knowledge in designing and developing web pages using HTML and CSS, focusing on user-friendly layouts. Built foundational skills in JavaScript to introduce dynamic content and improve user interaction across various web projects. Gained a deeper understanding of Web development tools like HTML, CSS and Javascript, improving my ability to build websites.",
        "website": ""
      }
    ],
    "mentorBridgeExp": {
      "company": "StuPro",
      "role": "Co-Founder | Front end Dev Engineer",
      "summary": "Built responsive and user-friendly mobile app screens using React Native Worked on navigation and implemented UI animations across the entire app to enhance user interactions. Developed the Forgot Password page with a seamless navigation flow. Managed state handling to optimize component behavior and improve app performance. Contributed to UI/UX design and collaborated with the team to create a clean and intuitive user experience. Followed the Agile methodology, ensuring continuous improvements through iterative feedback..",
      "website": "http://stupro.info"
    },
    "skillSets": [
      "HTML",
      "CSS",
      "React js",
      "Javascript",
      "Figma (Wireframing & Prototyping)",
      "SQL",
      "Excel"
    ],
    "inspirations": ["APJ Abdul Kalam"],
    "socialLinks": {
      "linkedIn": "https://www.linkedin.com/in/nithyabala02/",
      "gitHub": "https://github.com/Nithyabala2004",
      "website": ""
    },
    "batch": "2025",
    "company": "MentorBridge",
    "resumeLink": "https://wfkq0nguanh0273r.public.blob.vercel-storage.com/mentorbridge-pics/Nithya_Bala_M.pdf"
  },
  {
    "id": "Nivethitha_M",
    "name": "Nivethitha M",
    "picture": "https://wfkq0nguanh0273r.public.blob.vercel-storage.com/mentorbridge-pics/Nivethitha_M.jpeg",
    "role": "Backend Dev Engineer",
    "email": "nivethitha029@gmail.com",
    "summary": "A passionate Front-End Developer with a strong foundation in HTML, CSS, JavaScript, and modern frameworks like React.js. Skilled in building responsive, user-friendly web applications, I specialize in media queries, Bootstrap, and Node.js to create seamless experiences across devices. I have hands-on experience with API integration, UI/UX optimization, and email automation using Nodemailer in Node.js. With growing proficiency in the MERN stack(Express.js, React.js, Node.js), I am continuously learning and adapting to new technologies. I am seeking opportunities to grow as a Mern stack developer and contribute to innovative, dynamic projects.",
    "experience": [
      {
        "company": "Virtual Technology",
        "role": "Web Developer",
        "summary": "created a project Repair & Maintenance Service Website Clone and using Technologies like HTML, CSS, Media Queries, Responsive Design Designed product interfaces and user flows, contributing to the overall user experience of the platform. Created API documentation to facilitate easy understanding and implementation.",
        "website": "https://nivethithaabilash.github.io/Responsive-Website/"
      },
      {
        "company": "Seval software solutions",
        "role": "front-end developer and UI/UX designer",
        "summary": "worked in the project Event Management System and used Technologies like HTML, CSS, JavaScript, Media Queries, figma. Built a fully functional system that allows users to view, register, and manage events through a dynamic and user-friendly interface Implemented responsive design using media queries to ensure adaptability across devices.",
        "website": "https://nivethithaabilash.github.io/EventManagement--Website/"
      }
    ],
    "mentorBridgeExp": {
      "company": "StubLab",
      "role": "Co-Founder | Backend Dev Engineer",
      "summary": "Developed flexible API endpoints in Node.js with support for dynamic path/query parameters to simulate real-world backend behaviour. Integrated Node mailer and Postman to trigger email actions using API requests. Each trigger sent customized emails using React Email templates. Created responsive, professional-grade email templates in React. These templates were reusable and suitable for organizational communication like welcome emails, password resets, and alerts.Generated Swagger documentation for each API/email template created. This included details such as endpoint URL, method, parameters, and sample request/response structures.Enabled automatic API documentation updates during development.",
      "website": "https://www.stublab.in/"
    },
    "skillSets": [
      "React",
      "HTML",
      "Node.js",
      "CSS",
      "JavaScript",
      "bootstrap",
      "UI/UX",
      "mediaquery",
      "express.js"
    ],
    "inspirations": ["APJ Abdul Kalam", "Ratan Tata"],
    "socialLinks": {
      "linkedIn": "https://www.linkedin.com/in/nivethitha01/",
      "gitHub": "https://github.com/NivethithaAbilash",
      "website": ""
    },
    "batch": "2025",
    "company": "MentorBridge",
    "resumeLink": "https://wfkq0nguanh0273r.public.blob.vercel-storage.com/mentorbridge-pics/Nivethitha_M.pdf"
  },
  {
    "id": "prasanna",
    "name": "Prasanna",
    "picture": "https://wfkq0nguanh0273r.public.blob.vercel-storage.com/mentorbridge-pics/prasanna.jpg",
    "role": "Backend Dev Engineer",
    "email": "prasannap0218@gmail.com",
    "summary": "Innovative FullStack Developer , with a Strong foundation in Trending Technologies and ,Passion for creating the Websites to be More scalable , more Efficient and with the optimized Performance.",
    "experience": [
      {
        "company": "Sarva Vidhya Solutions",
        "role": "Full stack Developer Intern",
        "summary": "Built an ESS application with Express.js, MySQL, and JWT for managing employee leave records, featuring a secure admin-only dashboard for approvals. Built an Invoice Generator using Express.js and Puppeteer to generate invoices in PDF and image formats, with secure authentication for controlled access.",
        "website": null
      }
    ],
    "mentorBridgeExp": {
      "company": "Securosphere",
      "role": "Co-Founder | Technical Analyst",
      "summary": "Collaborated across frontend and backend teams to analyze user journeys and system performance, improving overall platform efficiency. Prepared detailed API documentation to support data integration and ensure clarity for development teams.",
      "website": "https://www.securosphere.in/"
    },
    "skillSets": ["React", "Node.js", "Spring Boot", "AWS", "Docker", "CI/CD"],
    "inspirations": ["APJ Abdul Kalam"],
    "socialLinks": {
      "linkedIn": "https://www.linkedin.com/in/p-prasanna-817b9027b/",
      "gitHub": "https://github.com/Prasanna0218",
      "website": "https://prasanna0218.github.io/Personal-Portfolio/"
    },
    "batch": "2025",
    "company": "CodiFi",
    "resumeLink": "https://wfkq0nguanh0273r.public.blob.vercel-storage.com/mentorbridge-pics/prasanna.pdf"
  },
  {
    "id": "Sakthi_Priya_S",
    "name": "Sakthi Priya S",
    "picture": "https://wfkq0nguanh0273r.public.blob.vercel-storage.com/mentorbridge-pics/Sakthi_Priya_S.jpg",
    "role": "Frontend Dev Engineer",
    "email": "sakthikannan823@gmail.com",
    "summary": "A frontend developer passionate about creating user-friendly interfaces. I specialize in  React Native and UI/UX design, focusing on building smooth and engaging digital experiences.. Currently, I contribute to StuPro, a platform that helps students transition into professionals. My role involves frontend development, UI enhancements, and product marketing to make the platform more intuitive and effective.",
    "experience": [],
    "mentorBridgeExp": {
      "company": "StuPro",
      "role": "Co-Founder | Frontend Dev Engineer | UX designer",
      "summary": "Authentication UI Design – Designed an intuitive login/signup experience to enhance user onboarding. Interactive Puzzle Card Component – Developed an engaging puzzle feature to boost user interaction. API Integration – Connected the frontend with the backend for seamless data flow. Product Analytics Integration – Implemented PostHog to track user behavior , improve platform insights and plays a  vital role in marketing.",
      "website": "http://stupro.info"
    },
    "skillSets": [
      "UI/UX",
      "JavaScript",
      "React Native",
      "TypeScript",
      "Html",
      "css"
    ],
    "inspirations": ["William Hanna", "Virat Kohli", "Senthil Kumar T"],
    "socialLinks": {
      "linkedIn": "https://www.linkedin.com/in/sakthi-priya-729156287/",
      "gitHub": "https://github.com/sakthipriya2326/sakthi",
      "website": ""
    },
    "batch": "2025",
    "company": "MentorBridge",
    "resumeLink": "https://wfkq0nguanh0273r.public.blob.vercel-storage.com/mentorbridge-pics/Sakthi_Priya_S.pdf"
  },
  {
    "id": "Santhana_Kaleeswari_S",
    "name": "Santhana Kaleeswari S",
    "picture": "https://wfkq0nguanh0273r.public.blob.vercel-storage.com/mentorbridge-pics/Santhana_Kaleeswari_S.jpg",
    "role": "Mobile App Developer",
    "email": "kaleeswari3167@gmail.com",
    "summary": "A Proficient in React Native with hands-on experience in Flutter for mobile app development, along with JavaScript, HTML, and CSS.Passionate about mobile app development and UI/UX design, focusingon building scalable, high-performance, and user-friendly applications.",
    "experience": [
      {
        "company": "Accent Techno Soft",
        "role": "Mobile App Developer",
        "summary": "Designed product interfaces and user flows, contributing to the overall user experience of the platform. Gained hands on knowledge in mobile app development framework.Developed mobile applications using flutter and sqlite",
        "website": "http://stupro.info"
      }
    ],
    "mentorBridgeExp": {
      "company": "StuPro",
      "role": "Co-Founder | Mobile App Developer",
      "summary": "Designed product interfaces and user flows, contributing to the overall user experience of the platform. UI Design using Figma and User Experience.Worked on Front end using React Native",
      "website": "http://stupro.info"
    },
    "skillSets": [
      "React",
      "TypeScript",
      "React native",
      "Flutter",
      "Html",
      "CSS",
      "Js"
    ],
    "inspirations": ["APJ Abdul Kalam"],
    "socialLinks": {
      "linkedIn": "https://www.linkedin.com/in/santhana-kaleeswari-seenivasan-17082b293",
      "gitHub": "https://github.com/santhanakaleeswari",
      "website": null
    },
    "batch": "2025",
    "company": "Frigate",
    "resumeLink": "https://wfkq0nguanh0273r.public.blob.vercel-storage.com/mentorbridge-pics/Santhana_Kaleeswari_S.pdf"
  },
  {
    "id": "sherin-sithara",
    "name": "Sherin Sithara M",
    "picture": "https://wfkq0nguanh0273r.public.blob.vercel-storage.com/mentorbridge-pics/sherin-sithara.jpeg",
    "role": "Backend Dev Engineer",
    "email": "sherinsithara0008@gmail.com",
    "summary": "A passionate and detail-oriented developer with experience in UI/UX design, front-end, and back-end development. Skilled in designing clean, user-friendly interfaces through wireframes and prototypes. Experienced in building responsive front-end layouts based on project needs. Developed back-end features to ensure efficient data handling and reliable application performance. As a Co-founder, contributed to product planning, design, and development with a focus on user-centered digital solutions. Values intuitive design, clear documentation, and continuous learning to create impactful and functional products.",
    "experience": [
      {
        "company": "Seval Software Solutions",
        "role": "Frontend Dev Engineer | UI/UX Desiger",
        "summary": "Designed clean and user-friendly interfaces using wireframes and prototypes. Improved user flows for better navigation and overall experience. Documented designs and front-end features for easy updates and collaboration.",
        "website": ""
      }
    ],
    "mentorBridgeExp": {
      "company": "StubLab",
      "role": "Co-Founder | Backend Dev Engineer | UI/UX Desiger",
      "summary": "Designed product interfaces and user flows, contributing to the overall user experience of the platform. Created API documentation to facilitate easy understanding and implementation.",
      "website": "https://stublab.in/"
    },
    "skillSets": [
      "C/C++",
      "Java",
      "Python",
      "HTML",
      "CSS",
      "JavaScript",
      "Node.js",
      "MongoDB",
      "CI/CD",
      "Git/GitHub",
      "Figma",
      "Canva"
    ],
    "inspirations": ["Elon Musk", "MS Dhoni"],
    "socialLinks": {
      "linkedIn": "https://www.linkedin.com/in/sherin-sithara-1a6244263/",
      "gitHub": "https://github.com/sherinsithara",
      "website": ""
    },
    "batch": "2025",
    "company": "MentorBridge",
    "resumeLink": "https://wfkq0nguanh0273r.public.blob.vercel-storage.com/mentorbridge-pics/sherin-sithara.pdf"
  },
  {
    "id": "Sivasankari",
    "name": "Sivasankari",
    "picture": "https://wfkq0nguanh0273r.public.blob.vercel-storage.com/mentorbridge-pics/Sivasankari.jpg",
    "role": "Backend dev Engineer",
    "email": "sivasankarikannan16@gmail.com",
    "summary": "Dynamic Java Backend Developer with extensive experience in crafting robust applications and systems. Committed to continuous learning and professional growth, aiming to excel in the Java development landscape.",
    "experience": [
      {
        "company": "Profenna Technology",
        "role": "Embedded IOT Engineer",
        "summary": "Gaining hands-on experience in IoT systems, sensor integration, and microcontroller programming.. Developed and implemented real-time embedded solutions for automation and smart devices.",
        "website": null
      },
      {
        "company": "RailNet",
        "role": "RailNet Internship Trainee",
        "summary": "Completed an internship at RailNet, gaining insights into the fundamentals of railway operations and infrastructure. Learned about railway functionalities, signaling systems, and network management.",
        "website": null
      }
    ],
    "mentorBridgeExp": {
      "company": "SecuroSphere",
      "role": "Co-Founder | Backend Dev Engineer",
      "summary": "In the role of Java Backend Developer at Mentor Bridge, expertise in building robust backend solutions using Java and Spring Boot is applied. This position involves designing and implementing RESTful APIs to support frontend functionalities while ensuring high performance and responsiveness.",
      "website": "https://www.securosphere.in/"
    },
    "skillSets": [
      "Java",
      "Springboot",
      "MongoDB",
      "SQL",
      "AWS",
      "Docker",
      "CI/CD"
    ],
    "inspirations": ["APJ Abdul Kalam", "Virat Kholi"],
    "socialLinks": {
      "linkedIn": "https://www.linkedin.com/in/sivasankari-k-3643b8266",
      "gitHub": "https://github.com/sivasankari-kannan",
      "website": null
    },
    "batch": "2025",
    "company": "CodiFi",
    "resumeLink": "https://wfkq0nguanh0273r.public.blob.vercel-storage.com/mentorbridge-pics/Sivasankari.pdf"
  },

  {
    "id": "Subash",
    "name": "Subash Natrayan",
    "picture": "https://wfkq0nguanh0273r.public.blob.vercel-storage.com/mentorbridge-pics/Subash.jpg",
    "role": "Frontend Dev Engineer",
    "email": "subashnatrayan6@gmail.com",
    "summary": "My role involves strategic planning, product development, and team coordination to ensure the platform meets industry standards and user expectations. My journey started with a fascination for how technology shapes our world, and before I knew it, I was co-founding startups like ProtecWatch and Stupro, leading front-end teams, and building solutions that bridge the gap between ideas and execution. Whether it's crafting seamless UI/UX, integrating machine learning into sign language translator hardware, or tackling real-world problems through hackathons, I thrive on challenges that push me beyond my limits.",
    "experience": [
      {
        "company": "Virtual Tech Services",
        "role": "AI/ML Intern",
        "summary": "During my AI/ML internship at Virtual Tech Services, I was actively involved in building and optimizing machine learning models for real-world applications. I gained hands-on experience in data preprocessing, analyzing large datasets, and implementing machine learning techniques and transformers to improve model performance. Additionally, I worked on deploying AI models in production environments, ensuring seamless integration and practical impact. This internship provided me with valuable exposure to cutting-edge AI technologies and real-world problem-solving.",
        "website": "https://virtualtechz.in/"
      },
      {
        "company": "Tarcin Robotics",
        "role": "Product Developer",
        "summary": "As a Product Developer at Tarcin Robotics, I was involved in designing and developing innovative robotic solutions tailored for automation and real-world applications. I worked on integrating hardware and software components to enhance robotic functionality, ensuring seamless interaction between sensors, actuators, and control systems. Additionally, I collaborated with cross-functional teams to optimize product performance, troubleshoot issues, and contribute to the overall improvement of robotic prototypes, gaining hands-on experience in both product development and real-world implementation.",
        "website": "https://tarcinrobotics.in/"
      },
      {
        "company": "Acmegrade",
        "role": "Cybersecurity Intern",
        "summary": "Conducted vulnerability assessments and penetration testing on web applications to identify security flaws and recommend mitigation strategies. Gained hands-on experience in network security, encryption techniques, and implementing security measures to protect sensitive data. Explored ethical hacking methodologies, working with tools like Kali Linux, Metasploit, and Wireshark to analyze and strengthen system defenses.",
        "website": "https://acmegrade.com/"
      },
      {
        "company": "Project Contest Innovation LLP",
        "role": "Cybersecurity Intern",
        "summary": "Worked on real-world cybersecurity projects, identifying threats and implementing security protocols to safeguard digital assets. Conducted security audits and compliance checks to ensure systems adhered to industry standards and best practices.",
        "website": "https://projectcontest.com/"
      },
      {
        "company": "ProtecWatch",
        "role": "Co-Founder",
        "summary": "As a Co-Founder of ProtecWatch, I played a pivotal role in developing a Security Watch for women safetey and cutting-edge sign language translator hardware solution. My responsibilities included designing the hardware architecture, integrating machine learning algorithms for real-time translation, and ensuring seamless communication between the device and user interfaces. This project not only showcased my technical skills but also highlighted my commitment to creating inclusive technology that bridges communication gaps.",
        "website": null
      }
    ],
    "mentorBridgeExp": {
      "company": "StuPro",
      "role": "Co-Founder | Lead Frontend Development Engineer",
      "summary": "As a Co-Founder of Stupro App, I lead the development of an innovative platform designed to assist students in transitioning from academia to professional careers. My role involves strategic planning, product development, and team coordination to ensure the platform meets industry standards and user expectations. I am also responsible for creating modules such as DeepLink, ArticleShare, ShareWithArticle, Push Notification, Swipe Card creation, Text-to-Speech conversion, Conversion to PDF, NativeBase package integration, Firebase configuration, animation, navigation, and API integration.",
      "website": "http://stupro.info"
    },
    "skillSets": [
      "React",
      "TypeScript",
      "Node.js",
      "Python",
      "AWS",
      "Docker",
      "Art Designs",
      "Machine Learning",
      "Spring Boot",
      "Kali Linux",
      "Agile Methodologies",
      "GitHub",
      "CI/CD"
    ],
    "inspirations": ["Nikola Tesla", "Akihiko Kayaba"],
    "socialLinks": {
      "linkedIn": "https://www.linkedin.com/in/subash-natrayan-r-m-4654aa319",
      "gitHub": "https://github.com/Thunderscotch",
      "website": null
    },
    "batch": "2025",
    "company": "Frigate",
    "resumeLink": "https://wfkq0nguanh0273r.public.blob.vercel-storage.com/mentorbridge-pics/Subash.pdf"
  },
  {
    "id": "umar_farook",
    "name": "Umar Farook J",
    "picture": "https://wfkq0nguanh0273r.public.blob.vercel-storage.com/mentorbridge-pics/umar_farook.png",
    "role": "Frontend Dev Engineer",
    "email": "umarfarookj06@gmail.com",
    "summary": "A motivated and enthusiastic web development fresher with a strong foundation in HTML, CSS, JavaScript, and modern frameworks like React.js. Passionate about building responsive, user-friendly web applications and eager to learn new technologies. Seeking an entry-level position to leverage my skills in front-end development and contribute to innovative projects while growing professionally in a dynamic environment.",
    "experience": [
      {
        "company": "Vinculo",
        "role": "Full Stack Developer",
        "summary": "As a key developer for Vinculo, an e-commerce platform for SSM Garments, I contributed to building a seamless and engaging shopping experience using MERN technology. My role focused on developing essential user-facing features and ensuring a responsive, intuitive, and secure platform across devices. Authentication System – Designed and implemented a secure Login & Register page, integrating authentication mechanisms for seamless user access. Product Display & View – Developed an interactive product listing and detail page, optimizing UI/UX for effortless Browse. Order & Checkout Flow – Created a smooth order processing system, including an Order Page and Order Confirmation Page to enhance the purchasing experience. User Profile Management – Designed a dynamic Profile Page where users can manage their details, track orders, and update preferences. Responsive Footer Design – Built a fully responsive footer for both desktop and mobile views, ensuring a clean and organized layout.",
        "website": "https://vinculoshop.com/"
      }
    ],
    "mentorBridgeExp": {
      "company": "Stublab",
      "role": "Co-Founder | Analyst",
      "summary": "As a Co-Founder and Analyst at StubLab, I have played a crucial role in developing a seamless API mocking platform that empowers developers to create, test, and iterate APIs efficiently. My contributions span both frontend and backend development, focusing on user experience, API management, and automation. Landing Page Development – Designed and built a visually engaging, responsive landing page to introduce users to the platform. Model Page Implementation – Developed an interactive model page for structuring and managing mock API responses. API Configuration Card – Created a dynamic API configuration card, allowing users to define endpoints, request types, and response behaviors easily. Swagger Integration – Implemented Swagger UI for API documentation, enabling developers to explore and test API functionalities within the platform. Status Code Management – Developed API endpoints to update and manage HTTP status codes for mock responses. Application Management – Implemented functionalities to delete applications from the system. Model & Form Updates – Created APIs to update models and form structures, allowing for flexible API testing configurations.",
      "website": "https://stublab.in"
    },
    "skillSets": [
      "React",
      "TypeScript",
      "Node.js",
      "Java",
      "HTML",
      "CSS",
      "JavaScript",
      "Bootstrap",
      "Express.js",
      "MongoDB",
      "Git",
      "Github"
    ],
    "inspirations": ["M S Dhoni"],
    "socialLinks": {
      "linkedIn": "https://www.linkedin.com/in/umar-farook-j-56b371280",
      "gitHub": "https://github.com/Umarfarook1912",
      "website": "https://umarfarookj.vercel.app/"
    },
    "batch": "2025",
    "company": "Frigate",
    "resumeLink": "https://wfkq0nguanh0273r.public.blob.vercel-storage.com/mentorbridge-pics/umar_farook.pdf"
  },
  {
    "id": "viji",
    "name": "Vijayalakshmi T",
    "picture": "https://wfkq0nguanh0273r.public.blob.vercel-storage.com/mentorbridge-pics/viji.jpg",
    "role": "Frontend Dev Engineer",
    "email": "vijayalakshmifsd@gmail.com",
    "summary": "Designed product interfaces and user flows, contributing to the overall user experience of the platform. Created API documentation to facilitate easy understanding and implementation.",
    "experience": [
      {
        "company": "Accent Techno Software",
        "role": "Webdeveloper",
        "summary": "Developed and maintained the user interface of a web-based Rail Pass Management System using HTML5, CSS3, and JavaScript. Ensured a clean, intuitive, and functional design that improved user interaction and engagement.",
        "website": null
      },
      {
        "company": "Virtuospark",
        "role": "Digital Marketing",
        "summary": "Designed a poster based on Webdevelopment, contributing to the overall user experience of the platform. Created API documentation to facilitate easy understanding and implementation.",
        "website": null
      }
    ],
    "mentorBridgeExp": {
      "company": "Stublab",
      "role": "Co-Founder | Front End Engineer",
      "summary": "Designed product interfaces and user flows, contributing to the overall user experience of the platform.",
      "website": "http://stublab.info"
    },
    "skillSets": [
      "HTML",
      "CSS",
      "JavaScript",
      "React.js",
      "Bootstrap",
      "Digital Marketing",
      "UI&UX Designer"
    ],
    "inspirations": ["APJ Abdul Kalam"],
    "socialLinks": {
      "linkedIn": "https://www.linkedin.com/public-profile/settings",
      "gitHub": "https://github.com/vijayalakshmiTHIRUMOORTHY",
      "website": null
    },
    "batch": "2025",
    "company": "MentorBridge",
    "resumeLink": "https://wfkq0nguanh0273r.public.blob.vercel-storage.com/mentorbridge-pics/viji.pdf"
  }
]
